%   RBF 3d warping demo by WangLin
%   wanglin193@hotmail.com

% clear all
% close all
%% 
% 1:105 OM,1为end，105为分叉，118为小支分叉
% 106:176 LCX近端，176为首部分叉
% 177:198 首，198为end
% 199:332 LAD 末，199为end,332为第三对角支叉
% 333:422 LAD主干，393为第一对角支分叉，422为第二对角支分叉
% 423:473 第二对角支，473-end
% 474:530 LCX远端，474-end
% 531:553 第三对角支，553为end
% 554:575 LCX上小支，575为end
% 576:602 第一对角支，576为end
% load pxs_comdata_ex03_SA0869_0010_LADLCX.mat
load FYL_lad_80.mat
load real_FuYaoLi_lad_90.mat
pbust = FYL_lad_80;

% % 00
% ps = [pbust(18,:);pbust(28,:);pbust(275,:);pbust(192,:);pbust(335,:);pbust(69,:)];
% pd = ps;
% pd(1,:) = [16.5 147 314];  % 左主干首?--18
% pd(2,:) = [24.6 140 317.6];  % 左主干分叉--28
% pd(3,:) = [28.4 135 317.5];  % 第一对角支分叉--275
% pd(4,:) = [29.4 96.7 296];  % 第二对角支分叉--192
% % % pd(5,:) = [26 123 310];  % LAD中段加--123
% % % pd(5,:) = [28 115 309];  % LAD中段1--137
% % pd(5,:) = [25.6 88 282];  % LAD中段2--138
% pd(5,:) = [45.6 110 303];  % 第一对角支中段--335
% % pd(6,:) = [43 106 298];  % 第一对角支mo段--1
% pd(6,:) = [44.6 132 312]; % LCX末段变化--69

% 控制点ps中第一个值为主干，第2-4个值分别为LAD前中末部分控制点，5-6为LCX首末控制点
%
% 构建10
% ps = [pbust(105,:);pbust(118,:);pbust(176,:);pbust(332,:);pbust(393,:);pbust(422,:);pbust(199,:);pbust(474,:);pbust(1,:)];
% pd = ps;
% pd(1,:) = [52 171.9 793.6];  % OM叉
% pd(2,:) = [53.5 170.8 798.3];  % LCX小支叉
% pd(3,:) = [36 150.83 826.19];  % 首部分叉
% pd(4,:) = [57 107.7 816.4];  % 第三对角支叉
% pd(5,:) = [51.6 136.4 823.17];  % 第一对角支分叉 
% pd(6,:) = [61 121 820];  % 第二对角支分叉
% pd(7,:) = [58.0048,93.1437,749.0235];  % LAD末
% pd(8,:) = [34.7153,175.4667,776.7022];  % LCX末
% pd(9,:) = [78.12 135.36 763.8]; % OM末


% 构建20
% ps = [pbust(105,:);pbust(118,:);pbust(176,:);pbust(332,:);pbust(393,:);pbust(422,:);pbust(199,:);pbust(474,:);pbust(1,:)];
% pd = ps;
% pd(1,:) = [53.6 173.7 792.6];  % OM叉
% pd(2,:) = [55.7 171.5 798.4];  % LCX小支叉
% pd(3,:) = [37.1 150.6 823.19];  % 首部分叉
% pd(4,:) = [57.2 107 814.4];  % 第三对角支叉
% pd(5,:) = [52.4 136.6 820.23];  % 第一对角支分叉 
% pd(6,:) = [61.63 119.5 818.7];  % 第二对角支分叉
% pd(7,:) = [61.16 94.23 749.24];  % LAD末
% pd(8,:) = [34.36,171.6,775.4];  % LCX末
% pd(9,:) = [78.12 135.36 763.8]; % OM末

% 30
% ps = [pbust(105,:);pbust(118,:);pbust(176,:);pbust(332,:);pbust(393,:);pbust(422,:);pbust(199,:);pbust(474,:)];
% pd = ps;
% pd(1,:) = [57.6 167.47 787.6];  % OM叉
% pd(2,:) = [58.7 166.4 795];  % LCX小支叉
% pd(3,:) = [38.9 149.6 821.89];  % 首部分叉
% pd(4,:) = [57.9 106.4 813.9];  % 第三对角支叉
% pd(5,:) = [54.4 134.6 818.89];  % 第一对角支分叉 
% pd(6,:) = [62.47 117.7 817.7];  % 第二对角支分叉
% pd(7,:) = [59.16 94.23 749.24];  % LAD末
% pd(8,:) = [38.36,165.6,767.4];  % LCX末
% % pd(9,:) = [78.12 135.36 763.8]; % OM末


% % 40
% ps = [pbust(105,:);pbust(118,:);pbust(176,:);pbust(332,:);pbust(393,:);pbust(422,:);pbust(199,:);pbust(474,:)];
% pd = ps;
% pd(1,:) = [59 166.47 786.1];  % OM叉
% pd(2,:) = [59.7 165.4 794];  % LCX小支叉
% pd(3,:) = [39.4 148.6 821.6];  % 首部分叉
% pd(4,:) = [57.9 104.6 813];  % 第三对角支叉
% pd(5,:) = [54.8 133.9 819.1];  % 第一对角支分叉 
% pd(6,:) = [63.27 117.3 817.6];  % 第二对角支分叉
% pd(7,:) = [61.16 94.23 749.24];  % LAD末
% pd(8,:) = [40.36,165.6,765.4];  % LCX末
% % pd(9,:) = [78.12 135.36 763.8]; % OM末

% % % 50
% ps = [pbust(105,:);pbust(118,:);pbust(176,:);pbust(332,:);pbust(393,:);pbust(422,:);pbust(199,:);pbust(474,:);pbust(1,:)];
% pd = ps;
% pd(1,:) = [59.6 166.47 786.5];  % OM叉
% pd(2,:) = [60.7 164.9 794];  % LCX小支叉
% pd(3,:) = [39.1 148.5 824];  % 首部分叉
% pd(4,:) = [58.44 106.1 813.9];  % 第三对角支叉
% pd(5,:) = [54.8 133.9 819.1];  % 第一对角支分叉 
% pd(6,:) = [63.27 117.3 817.6];  % 第二对角支分叉
% pd(7,:) = [59.16 94.23 751];  % LAD末
% pd(8,:) = [41.36,161.6,767.2];  % LCX末
% pd(9,:) = [80.12 129 761]; % OM末

% %60
% ps = [pbust(105,:);pbust(118,:);pbust(176,:);pbust(332,:);pbust(393,:);pbust(422,:);pbust(199,:);pbust(474,:);pbust(1,:);pbust(198,:);pbust(575,:)];
% pd = ps;
% pd(1,:) = [58.6 170.11 786.95];  % OM叉
% pd(2,:) = [59.4 169.1 795.4];  % LCX小支叉
% pd(3,:) = [37.35 152.5 824.7];  % 首部分叉
% pd(4,:) = [58.44 106.1 814.9];  % 第三对角支叉
% pd(5,:) = [54.6 136.6 820];  % 第一对角支分叉 
% pd(6,:) = [62.97 120.48 818.6];  % 第二对角支分叉
% pd(7,:) = [65 96.23 756];  % LAD末
% pd(8,:) = [46.36,161.6,767.2];  % LCX末
% pd(9,:) = [80.12 138 764]; % OM末
% pd(10,:) = [26.23 145.9 822.5]; % 首
% pd(11,:) = [70 161 789.3]; % LCX上小叉

% 70
% ps = [pbust(105,:);pbust(118,:);pbust(176,:);pbust(332,:);pbust(393,:);pbust(422,:);pbust(199,:);pbust(474,:);pbust(1,:);pbust(198,:);pbust(575,:)];
% pd = ps;
% pd(1,:) = [56.4 171.4 788.55];  % OM叉
% pd(2,:) = [57.86 169.9 795.84];  % LCX小支叉
% pd(3,:) = [37.35 152.5 825];  % 首部分叉
% pd(4,:) = [59.34 106.1 814.7];  % 第三对角支叉
% pd(5,:) = [54.6 136.6 820];  % 第一对角支分叉 
% pd(6,:) = [63.97 121.9 819.3];  % 第二对角支分叉
% pd(7,:) = [59 94.23 750];  % LAD末
% pd(8,:) = [40.36,164.9,769.2];  % LCX末
% pd(9,:) = [80.12 129 760]; % OM末
% pd(10,:) = [26.23 145.9 823]; % 首
% pd(11,:) = [68 161 790]; % LCX上小叉

% %80
% ps = [pbust(105,:);pbust(118,:);pbust(176,:);pbust(332,:);pbust(393,:);pbust(422,:);pbust(199,:);pbust(474,:);pbust(20,:);pbust(198,:);pbust(575,:)];
% pd = ps;
% pd(1,:) = [56.9 171.7 789.2];  % OM叉
% pd(2,:) = [57.86 169.9 796.44];  % LCX小支叉
% pd(3,:) = [37.35 152.5 825.5];  % 首部分叉
% pd(4,:) = [59.1 106.9 815.7];  % 第三对角支叉
% pd(5,:) = [54.6 135.6 821.6];  % 第一对角支分叉 
% pd(6,:) = [63.6 121.1 819.7];  % 第二对角支分叉
% pd(7,:) = [59 94.23 750];  % LAD末
% pd(8,:) = [39.63,168.4,769.7];  % LCX末
% pd(9,:) = [76.12 142.8 762.9]; % OM末
% pd(10,:) = [26.23 145.9 823.5]; % 首
% pd(11,:) = [66 161 790]; % LCX上小叉

% 90
ps = [pbust(105,:);pbust(118,:);pbust(176,:);pbust(332,:);pbust(393,:);pbust(422,:);pbust(199,:);pbust(474,:);pbust(80,:);pbust(198,:);pbust(575,:)];
pd = ps;
pd(1,:) = [56.9 171.7 789.2];  % OM叉
pd(2,:) = [57.7 170.5 796.54];  % LCX小支叉
pd(3,:) = [36.25 150.2 825.9];  % 首部分叉
pd(4,:) = [58.1 107.7 816.2];  % 第三对角支叉
pd(5,:) = [54.4 135.1 822.2];  % 第一对角支分叉 
pd(6,:) = [62.2 119.7 820.2];  % 第二对角支分叉
pd(7,:) = [58 94.13 749];  % LAD末
pd(8,:) = [39.63,168.4,767.7];  % LCX末
pd(9,:) = [60.12 165.1 773.5]; % OM末
pd(10,:) = [26.23 143 824]; % 首
pd(11,:) = [66 161 790]; % LCX上小叉

% ps为选中的landmark，pd为形变后的ladmark
% 
% figure(1),hold on,axis equal
% plot3(pbust(:,1),pbust(:,2), pbust(:,3),'.');
% legend('00期')
% plot3(ps(:,1),ps(:,2),ps(:,3),'g*');
% plot3(pd(:,1),pd(:,2),pd(:,3),'ro'); 
% view(3);
% title('Orininal mesh vs. warped mesh')
% xlabel('x'),ylabel('y'),zlabel('z');
% hold on;
%legend('Point set','Source landmarks','Destination landmarks')

%% 
if(1)
    %warp landmarks only
    ps_d = rbfwarp3d( ps, ps, pd, 'gau',10); % ps_d为形变后的landmark，可能会与目标landmark（pd）有差异
    %warp all points
    pbustw = rbfwarp3d( pbust, ps, pd, 'gau',10); % Pbustw为形变后的点集
else
    ps_d = rbfwarp3d( ps, ps, pd, 'thin');
    pbustw = rbfwarp3d( pbust, ps, pd, 'thin' );
end
 
figure(2),
shift = 0;
plot3(pbust(:,1),pbust(:,2), pbust(:,3),'b.');hold on;
plot3(real_FuYaoLi_lad_90(:,1),real_FuYaoLi_lad_90(:,2),real_FuYaoLi_lad_90(:,3),'r.');hold on;
plot3(pbustw(:,1),pbustw(:,2), pbustw(:,3),'.'); hold on;
plot3(ps_d(:,1)+shift,ps_d(:,2),ps_d(:,3),'rO');hold on;
xlabel('X');hold on;ylabel('Y');hold on;zlabel('Z');

FYL_lad_90 = pbustw;
save FYL_lad_90 FYL_lad_90

% 以上代码功能全部理解，可以用？

